[lang-en-US]
CLX BrainStorm 的功能激活碼，填FREE使用免費版本 = The activation code for CLX BrainStorm is FREE to use the free version.
Brainstorm 上次提问 = Brainstorm last question
HJKL光标加速度比率, 默认为 1, 你想慢点就改成 0.5 之类 = HJKL cursor acceleration rate, default is 1, change it to 0.5 if you want it slower.
使用IJKL滚轮移动滚轮，比RF多一个横轴。 = Use the IJKL wheel to move the wheel, adding one more horizontal axis than RF.
使用 Win+Alt+H 快速启动讯飞语音悬浮窗（默认启用） = Use Win+Alt+H to quickly launch the iFlyTek voice floating window (enabled by default)
U:PageDown I:PageUP 翻页速率 = PageDown PageUp Page Turn Rate
Tab速率 = Tab speed
禁用模拟鼠标模块 = Disable the simulated mouse module
使用 SendInput 方法提高模拟鼠标点击、移动性能 = Use the SendInput method to improve the performance of simulating mouse clicks and movements.
右手 \][ 模拟Windows键和 Alt + Tab， 具体用法参见LaptopKeyboardFix 模块说明，默认启用 = Right hand \][ simulates Windows key and Alt + Tab. For specific usage, refer to the LaptopKeyboardFix module instructions. Enabled by default.
使用 Windows API 强势提升模拟鼠标移动性能 = Enhance Mouse Movement Simulation Performance with Windows API
使用 Windows API 强势提升模拟鼠标滚轮性能（目前有bug不建议启用） = Enhance the performance of simulated mouse wheel using Windows API (currently has bugs and is not recommended to enable)
撞上屏幕边界后停止加速 = Stop accelerating after hitting the screen boundary.
启用自动粘附各种按钮，编辑框 = Enable automatic attachment of various buttons and edit boxes
是否根据屏幕 DPI 比率缩放鼠标速度 = Is the mouse speed scaled according to the screen DPI ratio?
鼠标加速度比率, 默认为 1, 你想慢点就改成 0.5 之类 = Mouse acceleration rate, default is 1, change it to 0.5 or so if you want it slower.
滚轮加速度比率, 默认为 1, 你想慢点就改成 0.5 之类 = Mouse wheel acceleration ratio, default is 1, change to 0.5 if you want it slower.
CapsLockX 载入成功 = CapsLockX loaded successfully
Edit config.ini = Edit config.ini
启动时显示配置窗口 = Show configuration window on startup
Reload CapsLockX = Reload CapsLockX
首次启动？若想重新进入首次使用教学，请改为 1 并保存，然后使用 Ctrl+Alt+\ 重载 CapsLockX。 = First time setup? If you want to re-enter the first-use tutorial, change it to 1 and save, then reload CapsLockX using Ctrl+Alt+\.
Exit CapsLockX = Exit CapsLockX
启用雪星并击（实验中），使用单手操作整个主键区 = Enable Snow Star and Strike (Experimental), use one-hand operation for the entire main key area.
在CLX+Z窗口切换时记住还原鼠标在每个窗口中的位置 = Remember the restored mouse position in each window when switching in the CLX+Z window.
启动时报告番茄状态 = Report tomato status on startup
使用番茄时钟（默认禁用，改为 1 开启） = Use Pomodoro (disabled by default, set to 1 to enable)
加载成功 = Loaded successfully
使用番茄报时（00分和30分播放工作铃声，每小时的25分和55分播放休息铃声）（需要先开启番茄时钟） = Use Pomodoro timing (play work chime at 00 and 30 minutes, play break chime at 25 and 55 minutes past each hour) (you need to start the Pomodoro clock first)
按 Win + L 锁定电脑时，立即关闭屏幕，默认不启用，你可以按 Win+Alt+L 达到该效果 = Press Win + L to lock the computer, and the screen will turn off immediately. This is not enabled by default, but you can achieve this effect by pressing Win + Alt + L.
使用番茄报时时，自动切换桌面（休息为桌面1，工作为桌面2） = Automatically switch desktops when using the Pomodoro timer (rest on desktop 1, work on desktop 2)
你可以按 'CapsLockX +, ' （CLX+逗号） 打开此窗口 = You can press 'CapsLockX + ,' (CLX+comma) to open this window.
当前配置目录： = Current configuration directory:
CLX脚本交流群： QQ群 100949388 、 Telegram 群 https://t.me/capslockx 、微信群: 添加 @snomiao 拉你 = CLX Scripting Group: QQ Group 100949388, Telegram Group https://t.me/capslockx, WeChat Group: Add @snomiao to be invited.
版本 = Version
作者: 雪星 ( Snowstar Miao <snomiao@gmail.com> ) = Author: Snowstar (Snowstar Miao <snomiao@gmail.com>)
确定 = Confirmed
切换語言 = Switch language
打开BUG反馈与建议页面 = Open the bug feedback and suggestions page
配置文件编辑 = Configuration file editing
添加开机自动启动 = Add startup boot launch
取消开机自动启动 = Remove startup boot launch
重新載入CapsLockX = Reload CapsLockX
打开官方文档 = Open the official document
启用番茄时钟，每25分钟休息5分钟·。 = Enable the Pomodoro technique, take a 5-minute break every 25 minutes.
使用 Space 作为引导键（默认启用） = Use Space as the guide key (enabled by default)
使用 CapsLock 作为引导键（默认启用） = Use CapsLock as a lead key (enabled by default)
请求管理员权限（权限受限时，鼠标模拟等功能无法正常运行，如果不需要管理权限下的功能，可以改为0） = Request administrator privileges (when permissions are restricted, functions such as mouse emulation cannot operate normally. If features requiring administrative privileges are not needed, you can change it to 0).
使用 CapsLock 作为引导键（默认启用，用户启用） = Use CapsLock as the guide key (enabled by default, user enabled)
使用 Space 作为引导键（默认启用，用户启用） = Use Space as the guide key (enabled by default, user enabled)
模块帮助有变更 = Module help has changed
警告：模块帮助未能稳定更新，如果你看到了这个消息，请联系雪星（QQ:997596439, 邮箱： snomiao@gmail.com） = Warning: The module help has not been updated consistently. If you see this message, please contact Xuexing (QQ: 997596439, Email: snomiao@gmail.com)
加载模块帮助： = Load module help:
跳过模块： = Skip Module:
运行模块： = Run Module:
请勿直接编辑本文件，以下内容由核心加载器自动生成。雪星/(20210318) = Please do not edit this file directly, the following content is automatically generated by the core loader. Snow Star/(20210318)
Unable to write ModulesRunner.ahk, if you are install with chocolatey, run me as admin at the first time please. = Unable to write ModulesRunner.ahk, if you installed with chocolatey, please run me as admin the first time.
注意：未能写入模块运行器，如果使用 chocolatey 首次安装后，请以管理员权限运行。 = Note: Failed to write to the module runner. If using Chocolatey for the first installation, please run as administrator.
加载模块帮助遇到错误。 = An error occurred while loading module help.
已为你打开 CapsLockX 主页，请手动更新 CapsLockX = The CapsLockX homepage has been opened for you, please manually update CapsLockX.
CapsLockX 错误 = CapsLockX Error
CapsLockX 异常退出，是否重载？ = CapsLockX exited unexpectedly. Reload?
CapsLockX 退出 = CapsLockX Exit
CapsLockX 已退出。 = CapsLockX has exited.
Anki导入 = Anki Import
获取到 = Obtained
没有获取到剪贴板的内容 = Failed to retrieve clipboard content
错误 = Error
未找到OneNote窗口 = OneNote window not found
Switch to diary tab = Switch to diary tab
Wait for title change after switching tabs = Wait for title change after switching tabs
当前語言 = Current language
Navigate to end of notebook = Navigate to end of notebook
Wait for title change after navigation = Wait for title change after navigation
搜索结果窗口不正确 = The search result window is incorrect
条笔记链接已复制 = The note link has been copied
OneNote 内容未能复制成功，5秒内按 Ctrl + C 可手动复制并尝试继续流程 = OneNote content failed to copy successfully. Press Ctrl + C within 5 seconds to manually copy and try to continue the process.
OneNote 内容未能复制成功 = OneNote content failed to copy successfully
超时未按下Alt键 = Timeout without pressing the Alt key
超时未放开Alt键 = Alt key not released in time
复制失败 = Copy failed
你似乎还没有安装讯飞语音输入法，是否现在下载安装包并【手动安装】到默认目录？ - [讯飞输入法官网 - 更好用的手机输入法，提供专业输入法定制解决方案！]( https://srf.xunfei.cn/\#/ ) = It seems that you haven't installed the iFlytek Voice Input Method yet. Would you like to download the installation package now and [manually install] it to the default directory? - [iFlytek Input Method Official Website - A more user-friendly mobile input method, providing professional input method customization solutions!](https://srf.xunfei.cn/\#/)
訪問官方網站来取得激活碼，在此輸入，或者填 FREE 使用免費版，網址如下： = Visit the official website to obtain the activation code, enter it here, or enter FREE to use the free version. The website is as follows:
激活碼輸入 = Activation code input
回邮件：选中一段邮件，输入 >> Reply this email = Reply to email: Select a section of the email, enter >> Reply this email
翻译：选中一段文字，输入 >> Translate to English/翻译到繁体中文/简体中文 = Translation: Select a piece of text and enter >> Translate to English/Translate to Traditional Chinese/Simplified Chinese
总结：选中一段文字，输入 >> Summary = Summary: Select a piece of text, enter >> Summary
提问：选中一段文字，输入 >> Question = Question: Select a piece of text and enter >> Question
以下为提問内容 = The following is the content of the question
请輸入文本指令 = Please enter text instructions
Going to Ask AI = Going to Ask AI
Asking AI = Asking AI
Ready to Ask AI = Ready to Ask AI
请检查激活码是否正确 = Please check if the activation code is correct.
请等待一段时间后再试 = Please try again after some time.
Unknown Error = Unknown Error
Fail to ask ai = Fail to ask AI
Waiting Answer... = Waiting Answer...
Chat streaming stopped, Copied to Clipboard, Press [ESC] to hide. = Chat streaming stopped, Copied to Clipboard, Press [ESC] to hide.
Copied to Clipboard, Press [ESC] to hide. = Copied to Clipboard, Press [ESC] to hide.
Press [ESC] to stop. = Press [ESC] to stop.
EvalJS 模块 = EvalJS Module
正在启动 NodeJS 筆記服務... = Starting NodeJS note service...
NodeJS 服务已启动。 = NodeJS service has started.
执行失败，未能写入脚本文件 = Execution failed, unable to write to script file
暂停 = Pause
CapsLockX 已暂停 = CapsLockX is paused
CapsLockX 已恢复 = CapsLockX has been restored
CapsLockX 重载模块 = CapsLockX Reload Module
检测到配置更改，是否软重载？ = Configuration change detected, would you like to soft reload?
检测到配置更改，正在自动软重载。 = Configuration change detected, automatically performing a soft reload.
检测到配置更改，正在自动重载。 = Configuration change detected, reloading automatically.
检测到配置更改，是否重载？ = Configuration change detected, reload?
已在Startup文件夹添加CLX的开机自启动，请确认。 = CLX has been added to the Startup folder for automatic startup, please confirm.
Choose your language, default option is auto = Choose your language, default option is auto.
For example: zh,ja,en,fr,es,ar...' = For example: zh, ja, en, fr, es, ar...
Change Language of CapsLockX = Change Language of CapsLockX
开始编辑用户脚本： = Start editing user script:
切换到桌面： = Switch to desktop:
双击 LCtrl LAlt LShift 来最后置当前窗口（主要用于虚拟机和远程桌面） = Double-click LCtrl LAlt LShift to send the current window to the back (mainly used for virtual machines and remote desktops)
最近1分钟内闪动窗口激活 = Flash window activation in the last minute
已经配置过高精度时间的Flag = Flag with high precision time already configured
番茄时钟： = Pomodoro Timer:
工作时间到啦！ = It's time to work!
起来运动一下收拾收拾东西！ = Get up, move around, and tidy things up!
CapsLockX 重载中 = CapsLockX reloading
Creating TODAY-NOTE = Creating TODAY-NOTE
# 帮助模块\n\n如果你想学习如何开发 CapsLockX 的插件，请：\n\n1. 打开 `Modules/@Help.ahk` ， 你可以了解到 CapsLockX 插件的基本格式\n2. 将它复制一份，命名为你自己的插件名称\n3. 将它本来的功能改成你自己需要的功能，插件的开发就完成啦！\n\n## 本模块功能见下\n\n| 作用于 | 按键                  | 功能                             |\n| ------ | --------------------- | -------------------------------- |\n| 全局   | CapsLockX + /         | 临时显示热键提示                 |\n| 全局   | CapsLockX + Alt + /   | 🔗 打开 CapsLockX 的完整文档页面 |\n| 全局   | CapsLockX + Shift + / | 🕷 提交 bug、建议等              |=# Help Module\n\nIf you want to learn how to develop a plugin for CapsLockX, please:\n\n1. Open `Modules/@Help.ahk` to learn about the basic format of a CapsLockX plugin.\n2. Copy it and name it your own plugin name.\n3. Change its original function to the one you need, and the development of your plugin is complete!\n\n## Features of this module are as follows\n\n| Scope  | Key                    | Function                          |\n| ------ | ---------------------- | --------------------------------- |\n| Global | CapsLockX + /          | Temporarily display hotkey hints  |\n| Global | CapsLockX + Alt + /    | 🔗 Open CapsLockX full documentation page |\n| Global | CapsLockX + Shift + /  | 🕷 Submit bugs, suggestions, etc.  |
# Anki 增强模块\n\nAnki 操作增强\n\n## 常用功能/特性\n\n1. 使用 WASD 或 HJKL 来快速连续地（并且可以撤销）切换记忆卡片\n2. 在 Excel 制作一个单词列表，共 2 列， 全选复制，然后在 Anki 中按 Alt + i 来快速导入单词列表。\n3. 简化 4 个选项为 3 个方向键，左易，下中，右难，上撤销。\n4. 可配合手柄使用，使用 XPadder 配置手柄摇杆映射到方向键即可。效果请见 bilibili [中二雪星怎背词 - 手柄怎么可以不用来背单词！](https://www.bilibili.com/video/av8456838/)\n\n## 说明\n\n| 模式                 | Anki 增强模块  | 说明                                                        |\n| -------------------- | :------------: | ----------------------------------------------------------- |\n| 在 Anki-学习界面     | `w 或 k 或 ↑`  | 按下\e撤销，松开显示答案                                     |\n| 在 Anki-学习界面     | `a 或 h 或 ←`  | 按下\e顺利，松开显示答案                                     |\n| 在 Anki-学习界面     | `s 或 j 或 ↓`  | 按下\e一般，松开显示答案                                     |\n| 在 Anki-学习界面     | `d 或 l 或 →`  | 按下\e生疏，松开显示答案                                     |\n| 在 Anki-学习界面     |      `q`       | 返回上个界面                                                |\n| 在 Anki-学习界面     |      `c`       | 添加新卡片                                                  |\n| 在 Anki-学习界面     | `1 或 NumPad1` | 困难（原键位）                                              |\n| 在 Anki-学习界面     | `2 或 NumPad2` | 生疏（原键位）                                              |\n| 在 Anki-学习界面     | `3 或 NumPad3` | 一般（原键位）                                              |\n| 在 Anki-学习界面     | `4 或 NumPad4` | 顺利（原键位）                                              |\n| 在 Anki-学习界面     | `5 或 NumPad5` | 撤销                                                        |\n| 在 Anki-学习界面     | `6 或 NumPad6` | 暂停卡片                                                    |\n| 在 Anki-学习界面     |   `Alt + i`    | 快速导入剪贴版的内容（按 Tab 分割） / 比如可以从 Excel 复制 |\n| 在 Anki-添加卡片界面 |   `Alt + s`    | 按下 添加 按钮                                              |=# Anki Enhancement Module\n\nAnki Operation Enhancement\n\n## Common Features\n\n1. Use WASD or HJKL to quickly and continuously switch memory cards (and can undo)\n2. Create a word list in Excel, with 2 columns, select all and copy, then press Alt + i in Anki to quickly import the word list.\n3. Simplify 4 options into 3 directional keys: left easy, down moderate, right hard, up undo.\n4. Compatible with game controllers, use XPadder to map joystick to directional keys. See bilibili [Chūnibyō Xuexing Zembey Words - How a Controller is Not Just for Words!](https://www.bilibili.com/video/av8456838/)\n\n## Instructions\n\n| Mode                 | Anki Enhancement Module | Description                                               |\n| -------------------- | :----------------------: | --------------------------------------------------------- |\n| In Anki Study Interface     | `w or k or ↑`         | Press\eUndo, Release\eShow Answer                           |\n| In Anki Study Interface     | `a or h or ←`         | Press\eEasy, Release\eShow Answer                           |\n| In Anki Study Interface     | `s or j or ↓`         | Press\eModerate, Release\eShow Answer                       |\n| In Anki Study Interface     | `d or l or →`         | Press\eHard, Release\eShow Answer                           |\n| In Anki Study Interface     | `q`                  | Return to previous interface                              |\n| In Anki Study Interface     | `c`                  | Add new card                                              |\n| In Anki Study Interface     | `1 or NumPad1`       | Difficult (original key)                                  |\n| In Anki Study Interface     | `2 or NumPad2`       | Hard (original key)                                       |\n| In Anki Study Interface     | `3 or NumPad3`       | Moderate (original key)                                   |\n| In Anki Study Interface     | `4 or NumPad4`       | Easy (original key)                                       |\n| In Anki Study Interface     | `5 or NumPad5`       | Undo                                                      |\n| In Anki Study Interface     | `6 or NumPad6`       | Suspend card                                              |\n| In Anki Study Interface     | `Alt + i`            | Quickly import clipboard content (separated by Tab) / For instance, copy from Excel |\n| In Anki Add Card Interface | `Alt + s`            | Press Add button                                          |
# 讯飞输入法悬浮窗插件\n\n## 用法\n\n| 作用于 |     按键      | 功能说明              |\n| ------ | :-----------: | --------------------- |\n| 全局   | Win + Alt + H | 启动/切换讯飞语音输入 |\n\n## 注\n\n1. 若没有安装讯飞语音则会自动询问是否引导下载安装\n\n## 效果如下图\n\n![App-讯飞语音输入法悬浮窗演示.gif](./docs/media/App-讯飞语音输入法悬浮窗演示.gif)=# iFlytek Input Method Floating Window Plugin\n\n## Usage\n\n| Applied to |    Key     | Function Description   |\n| ---------- | :--------: | ---------------------- |\n| Global     | Win + Alt + H | Start/Switch iFlytek Voice Input |\n\n## Notes\n\n1. If iFlytek Voice is not installed, it will automatically prompt whether to guide to download and install.\n\n## The effect is as shown in the following image\n\n![App-iFlytek Voice Input Method Floating Window Demo.gif](./docs/media/App-讯飞语音输入法悬浮窗演示.gif)
# CLX - Brainstorm 大脳风暴\n\n任何時間，任何輸入框，按下 `CLX+b` 鍵，開始使用 AI 輔助輸入。\n\n## 按键分布（开发中）\n\n| 按键描述        | 作用                                                 | 备注 |\n| --------------- | ---------------------------------------------------- | ---- |\n| CLX + b         | 自動複製当前选中内容，輸入指令，让 AI 辅助你的輸入   |      |\n| CLX + Alt + b   | 配置激活碼（目前只有免費方案，将来可能加入功能増強） |      |\n| CLX + Shift + b | 査看使用額度                                         |      |\n\n## Protips:\n\n### 随時整理会議記録\n\n1. 任何輸入框内，使用 Win+H 來調出語音輸入，然後說出你想要的文字，不用在意語音輸入的準確度，只要說出大概的意思就可以了，\n2. 然後全選按下 `CLX+b`，輸入 `列出要点和待辦事項`，就可以看到 AI 自動幫你整理出來的要點和待辦事項。\n\n### 随時翻訳任何語言到任何語言\n\n1. 任何輸入框内，选中你想要翻譯的文字\n2. 然後全選按下 `CLX+b`，`to chinese:` AI 自動幫你輸入成中文。=# CLX - Brainstorm\n\nAt any time, in any input box, press the `CLX+b` key to start using AI-assisted input.\n\n## Key Distribution (In Development)\n\n| Key Description    | Function                                            | Notes |\n| ------------------ | --------------------------------------------------- | ----- |\n| CLX + b            | Automatically copy current selection, input command, let AI assist your input |       |\n| CLX + Alt + b      | Configure activation code (currently only free plan, enhancements may be added in the future) |       |\n| CLX + Shift + b    | Check usage quota                                  |       |\n\n## Protips:\n\n### Always Organize Meeting Records\n\n1. In any input box, use Win+H to bring up voice input, then say what you want to write. Don't worry about accuracy, just get the gist.  \n2. Then select all, press `CLX+b`, input `list key points and tasks`, and AI will automatically organize key points and tasks for you.\n\n### Always Translate Any Language to Any Language\n\n1. In any input box, select the text you want to translate.  \n2. Then select all, press `CLX+b`, `to Chinese:` and AI will automatically translate into Chinese.
# OneNote 2016 - 2019 增强\n\n朴素地增强 OneNote 2016 - 2019 的键盘操作，便捷地使用键盘来：换笔，制作链接，整理页面，调整视图……\n\n## 雪星喵常用功能\n\n1. 做日志的时候，先在笔记页面 `Alt + T` 给笔记标题添加日期标签（用于将来搜索），然后全局 `Win + Shift + N` 在 OneNote 搜索带有 今日标签 的所有笔记，用来方便地检索你今日的：恋爱日记、训练日志、每日书单、项目日报……总之在 OneNote 写日记就很方便了，一按就出来，不用找 XD\n2. 选一个词按 `Alt + K` ，会把所有相关的页面链接列到这个词的下方，用来做索引目录，把你的 OneNote 织成一张网。\n3. 新建一个笔记，改名叫 `我的剪贴板`，然后在复制文本、图片的时候，CLX 会帮你自动追加到这个笔记，用于方便地收集资料或摘抄文章。\n4. Alt + 1234567 层级折叠，轻松地在不同抽象层次的思考上切换。\n\n## 按键分布设计（开发中）\n\n| 按键描述                | 作用                    | 备注       |\n| ----------------------- | ----------------------- | ---------- |\n| `所有 OneNote 自带热键` | 原功能                  |            |\n| `按一下 Alt 再按别的`   | 触发 OneNote 原菜单功能 |            |\n| `Alt + 1234567`         | 大纲折叠展开到 1-7 层级 |            |\n| `Alt + qwe asd r`       | 工具、换笔、视图        |            |\n| `Alt + f`               | 查找标签                |            |\n| `Alt + -\e`              | 公式相关                |            |\n| `Alt + m`               | 移动笔记、分区          |            |\n| `Alt + hjkl`            | 各种链接功能            |            |\n| `Alt + zxcv`            | 高级复制粘贴            | 细节开发中 |\n| `Alt + /`               | 热键帮助、提示          | 开发中     |\n| `F2 F3`                 | 重命名、查找笔记        |            |\n\n## 详细按键表 / CheatSheet\n\n| 作用于                   | 格式热键                     | 功能                                                                      |\n| ------------------------ | ---------------------------- | ------------------------------------------------------------------------- |\n| 全局                     | `Win + Alt + N`              | 打开快速笔记第一页（弥补 OneNote 原本没有像 Notion 一样的首页概念的不足） |\n| 全局                     | `Win + Shift + N`            | 打开 OneNote 并精确搜索今日标签                                           |\n| OneNote2019              | `Alt + 1234567`              | 大纲：大纲折叠展开到那层（强烈推荐，超好用）                              |\n| OneNote2019              | `F2`                         | 整理：重命名笔记                                                          |\n| OneNote2019              | `Shift + F2`                 | 整理：重命名分区                                                          |\n| OneNote2019              | `Alt + m`                    | 整理：移动笔记                                                            |\n| OneNote2019              | `Alt + Shift + m`            | 整理：移动分区                                                            |\n| OneNote2019              | `Ctrl + n`                   | 整理：新建笔记                                                            |\n| OneNote2019              | `Ctrl + Alt + n`             | 整理：在当前笔记下方新建笔记                                              |\n| OneNote2019              | `Alt + Delete`               | 整理：快速删除当前页面                                                    |\n| OneNote2019              | `Ctrl + s`                   | 整理：立即同步此笔记本                                                    |\n| OneNote2019              | `Ctrl + w`                   | 整理：关闭窗口                                                            |\n| OneNote2019              | `Shift + Delete`             | 编辑：快速删除当前行                                                      |\n| OneNote2019              | `Alt + -`                    | 编辑：自动 2 维化公式                                                     |\n| OneNote2019              | `Alt + k`                    | 编辑：⭐🔗 展开当前关键词的相关页面链接（快速关键词一对多链接）           |\n| OneNote2019              | `Alt + n`                    | 样式：切换页面为无色背景                                                  |\n| OneNote2019              | `Alt + v`                    | 样式：改变文字背景色                                                      |\n| OneNote2019              | `Alt + q`                    | 工具：拖动                                                                |\n| OneNote2019              | `Alt + w`                    | 工具：套锁                                                                |\n| OneNote2019              | `Alt + e`                    | 工具：橡皮                                                                |\n| OneNote2019              | `Alt + s`                    | 工具：输入                                                                |\n| OneNote2019              | `Alt + a`                    | 工具：换到第 2 支笔                                                       |\n| OneNote2019              | `Alt + d`                    | 工具：打开换笔盘（然后可可方向键选笔 （目前全屏无效）                     |\n| OneNote2019              | `Alt + d -> 1234567`         | 工具：打开换笔盘（然后选第 1 行第 x 支笔） （目前全屏无效）               |\n| OneNote2019              | `Alt + d -> Shift + 1234567` | 工具：打开换笔盘（然后选第 2 行第 x 支笔） （目前全屏无效）               |\n| OneNote2019              | `Alt + r`                    | 视图：缩放到原始大小                                                      |\n| OneNote2019              | `Alt + y`                    | 视图：缩放到页面宽度                                                      |\n| OneNote2019              | `^!+- 或 ^!+\e`               | 视图：缩小页面 或 放大页面                                                |\n| OneNote2019              | `Alt + f`                    | 视图：搜索标记                                                            |\n| OneNote2019              | `Alt + t`                    | 编辑：给笔记增加日期标签，例如： (20220717)                               |\n| OneNote2019              | `Ctrl + Shift + c`           | 编辑：复制（纯文本）                                                      |\n| OneNote2019              | `Ctrl + Shift + v`           | 编辑：粘贴（纯文本）                                                      |\n| OneNote2019 创建链接窗口 | `Alt + s`                    | 编辑：复制当前所有搜索结果页面的链接                                      |\n| OneNote2019 创建链接窗口 | `Alt + Shift + s`            | 编辑：复制当前所有搜索结果页面的链接并粘贴                                |\n| OneNote2019 剪贴板笔记   | `Ctrl + C`                   | 编辑：⭐ 追加复制的内容到名称中含有 "Clipboard" 或 "剪贴板" 的笔记        |=# OneNote 2016 - 2019 Enhancements\n\nEnhance OneNote 2016 - 2019 keyboard operations with ease, using the keyboard to switch pens, create links, organize pages, adjust views...\n\n## Common Features by SnowStarCat\n\n1. When logging, first add a date tag to the note title with `Alt + T` (for future search), then globally `Win + Shift + N` search all notes with today's tag in OneNote, making it easy to retrieve your daily: love diary, training log, daily booklist, project report... It's convenient to write a diary in OneNote, one press and it's there, no searching needed XD\n2. Select a word and press `Alt + K`, and all related page links will be listed below that word, creating an index directory, weaving your OneNote into a net.\n3. Create a new note, rename it `My Clipboard`, then when copying text or images, CLX will automatically append to this note, making it easy to collect information or extract articles.\n4. Alt + 1234567 level collapse, easily switching between different levels of abstraction in thinking.\n\n## Key Distribution Design (Under Development)\n\n| Key Description          | Function                  | Remarks    |\n| ------------------------ | ------------------------- | ---------- |\n| `All OneNote Hotkeys`    | Original Function         |            |\n| `Press Alt then Other`   | Trigger OneNote Menu      |            |\n| `Alt + 1234567`          | Outline Collapse/Expand to Levels 1-7 |            |\n| `Alt + qwe asd r`        | Tools, Pen Switch, View   |            |\n| `Alt + f`                | Find Tag                  |            |\n| `Alt + -\e`               | Formula Related           |            |\n| `Alt + m`                | Move Note/Section         |            |\n| `Alt + hjkl`             | Various Link Functions    |            |\n| `Alt + zxcv`             | Advanced Copy/Paste       | In Development |\n| `Alt + /`                | Hotkey Help/Prompt        | In Development |\n| `F2 F3`                  | Rename/Find Note          |            |\n\n## Detailed Key Table / CheatSheet\n\n| Applied To               | Format Hotkey                  | Function                                                                   |\n| ------------------------ | ------------------------------ | ------------------------------------------------------------------------- |\n| Global                   | `Win + Alt + N`                | Open First Quick Note Page (Compensating for lack of home page like Notion) |\n| Global                   | `Win + Shift + N`              | Open OneNote and Search for Today's Tag                                   |\n| OneNote2019              | `Alt + 1234567`                | Outline: Collapse/Expand to that Level (Highly Recommended, Very Useful)  |\n| OneNote2019              | `F2`                           | Organize: Rename Note                                                     |\n| OneNote2019              | `Shift + F2`                   | Organize: Rename Section                                                  |\n| OneNote2019              | `Alt + m`                      | Organize: Move Note                                                       |\n| OneNote2019              | `Alt + Shift + m`              | Organize: Move Section                                                    |\n| OneNote2019              | `Ctrl + n`                     | Organize: New Note                                                        |\n| OneNote2019              | `Ctrl + Alt + n`               | Organize: Create New Note Below Current                                   |\n| OneNote2019              | `Alt + Delete`                 | Organize: Quickly Delete Current Page                                     |\n| OneNote2019              | `Ctrl + s`                     | Organize: Sync Notebook Immediately                                       |\n| OneNote2019              | `Ctrl + w`                     | Organize: Close Window                                                    |\n| OneNote2019              | `Shift + Delete`               | Edit: Quickly Delete Current Line                                         |\n| OneNote2019              | `Alt + -`                      | Edit: Automatically 2D Formula                                            |\n| OneNote2019              | `Alt + k`                      | Edit: ⭐🔗 Expand Links to Related Pages Under Current Keyword (Quick Keyword One-to-Many Linking) |\n| OneNote2019              | `Alt + n`                      | Style: Switch to Colorless Background Page                                |\n| OneNote2019              | `Alt + v`                      | Style: Change Text Background Color                                       |\n| OneNote2019              | `Alt + q`                      | Tools: Drag                                                               |\n| OneNote2019              | `Alt + w`                      | Tools: Lasso                                                              |\n| OneNote2019              | `Alt + e
# 编辑增强插件（ TG YUIO HJKL ） 🌟\n\n这个世界上还有比 Vim 模式的 HJKL 移动光标更棒的东西吗？\n这个必须有！\n那就是带加速度的 HJKL 流畅编辑体验！想不想试试让你的光标来一次排水沟过弯的高端操作？装它！\n\n![EditorCursorMovement.gif](./docs/media/EditorCursorMovement.gif)\n\n| 作用域     | Edit 模块             | 说明                             |\n| ---------- | --------------------- | -------------------------------- |\n| 全局(基本) | `CapsLockX + h j k l` | 上下左右 方向键                  |\n| 全局(基本) | `CapsLockX + y o`     | Home End                         |\n| 全局(基本) | `CapsLockX + u i`     | PageUp PageDown                  |\n| 全局(基本) | `CapsLockX + [ ]`     | Shift+Tab 和 Tab                 |\n| 全局(基本) | `CapsLockX + g`       | 回车                             |\n| 全局(进阶) | `CapsLockX + t`       | Delete                           |\n| 全局(进阶) | `CapsLockX + hl`      | hl 一起按选择当前词              |\n| 全局(进阶) | `CapsLockX + kj`      | kj 一起按选择当前行              |\n| 全局(进阶) | `CapsLockX + h + t`   | 移位后删：大部分情况可代替退格键 |=# Editing Enhancement Plugin (TG YUIO HJKL) 🌟\n\nIs there anything better in this world than moving the cursor with Vim mode's HJKL? There must be! Introducing the accelerated HJKL for a smooth editing experience! Want to try making your cursor perform high-end maneuvers like cornering a drain? Install it!\n\n| Scope      | Edit Module          | Description                          |\n| ---------- | --------------------- | ------------------------------------ |\n| Global(Basic) | `CapsLockX + h j k l` | Arrow keys                           |\n| Global(Basic) | `CapsLockX + y o`    | Home End                             |\n| Global(Basic) | `CapsLockX + u i`    | PageUp PageDown                      |\n| Global(Basic) | `CapsLockX + [ ]`    | Shift+Tab and Tab                    |\n| Global(Basic) | `CapsLockX + g`      | Enter                                |\n| Global(Advanced) | `CapsLockX + t`    | Delete                              |\n| Global(Advanced) | `CapsLockX + hl`   | Press hl together to select the current word |\n| Global(Advanced) | `CapsLockX + kj`   | Press kj together to select the current line |\n| Global(Advanced) | `CapsLockX + h + t`| Shift and Delete: can replace Backspace in most cases |
# Surface 笔记本扩充功能键\n\n专治各种笔记本残破键盘\n\n1. 没有右 Ctrl 键？合并 Menu 与 右 Ctrl 键，Menu 当 Ctrl 用 或者 Ctrl 当 Menu 用都可以\n2. 没有 Pause 键？Win + Alt + P 也能打开系统设定信息。\n3. 待补充\n\n| 模式             | 按键                                  | 功能                               |\n| ---------------- | :------------------------------------ | ---------------------------------- |\n| 全局             | Win + Alt + P                         | 相当于 Win + Pause，专为笔记本定制 |\n| 全局             | 右 Ctrl 按一下                        | 会按一下 Menu 弹出菜单             |\n| 全局             | 按住右 Menu                           | 会按住 Ctrl，此时可以与其它键组合  |\n| Win 键模拟启用后 | ] 按住同时，[ 按下                    | 相当于按 Win 键                    |\n| Win 键模拟启用后 | RAlt+\\| 相当于按 Alt+Tab 只不过在右手 |=# Surface Laptop Extended Function Keys\n\nSpecifically for Broken Laptop Keyboards\n\n1. No Right Ctrl Key? Merge Menu with Right Ctrl key; Menu can act as Ctrl or Ctrl can act as Menu.\n2. No Pause Key? Win + Alt + P can also open system settings information.\n3. To be supplemented\n\n| Mode             | Key                                   | Function                            |\n| ---------------- | :------------------------------------ | ---------------------------------- |\n| Global           | Win + Alt + P                         | Equivalent to Win + Pause, tailored for laptops |\n| Global           | Right Ctrl click                      | Clicks Menu to pop up menu          |\n| Global           | Hold Right Menu                       | Acts as Ctrl and can be combined with other keys |\n| After Win Key Simulation Enabled | ] Hold while [ Press  | Equivalent to Press Win Key         |\n| After Win Key Simulation Enabled | RAlt+\\| Equivalent to Alt+Tab but for right hand |
# 媒体键模块\n\n| 作用于 | 媒体键模块        | 说明                                        |\n| ------ | ----------------- | ------------------------------------------- |\n| 全局   | `CapsLockX + F1`  | 打开：我的电脑                              |\n| 全局   | `CapsLockX + F2`  | 打开：计算器                                |\n| 全局   | `CapsLockX + F3`  | 打开：浏览器主页                            |\n| 全局   | `CapsLockX + F4`  | 打开：媒体库（默认是 Windows Media Player） |\n| 全局   | `CapsLockX + F5`  | 播放：暂停/播放                             |\n| 全局   | `CapsLockX + F6`  | 播放：上一首                                |\n| 全局   | `CapsLockX + F7`  | 播放：下一首                                |\n| 全局   | `CapsLockX + F8`  | 播放：停止                                  |\n| 全局   | `CapsLockX + F9`  | 音量加                                      |\n| 全局   | `CapsLockX + F10` | 音量减                                      |\n| 全局   | `CapsLockX + F11` | 静音                                        |=# Media Key Module\n\n| Applies To | Media Key Module | Description                                   |\n| ---------- | ---------------- | --------------------------------------------- |\n| Global     | `CapsLockX + F1` | Open: My Computer                             |\n| Global     | `CapsLockX + F2` | Open: Calculator                              |\n| Global     | `CapsLockX + F3` | Open: Browser Homepage                        |\n| Global     | `CapsLockX + F4` | Open: Media Library (default is Windows Media Player) |\n| Global     | `CapsLockX + F5` | Play: Pause/Play                              |\n| Global     | `CapsLockX + F6` | Play: Previous Track                          |\n| Global     | `CapsLockX + F7` | Play: Next Track                              |\n| Global     | `CapsLockX + F8` | Play: Stop                                    |\n| Global     | `CapsLockX + F9` | Volume Up                                     |\n| Global     | `CapsLockX + F10`| Volume Down                                   |\n| Global     | `CapsLockX + F11`| Mute                                          |
# JavaScript 计算 (建议安装 NodeJS )\n\n| 作用于 | 按键            | 效果                                   |\n| ------ | --------------- | -------------------------------------- |\n| 全局   | `CapsLockX + -` | 计算当前选区 JavaScript 表达式，并替换 |\n| 全局   | `CapsLockX + \e` | 计算当前选区 JavaScript 表达式，并替换 |=# JavaScript Calculation (NodeJS Installation Recommended)\n\n| Scope | Key             | Effect                                      |\n| ----- | --------------- | ------------------------------------------- |\n| Global| `CapsLockX + -` | Evaluate the selected JavaScript expression and replace |\n| Global| `CapsLockX + \e` | Evaluate the selected JavaScript expression and replace |
# 模拟鼠标插件（ WASD QERF ）\n\n> 一直以来，我总是以键盘控自居，应该是在从前做模型的时候伤到了手指关节开始，成为键盘重度用户的。各种键盘加速工具，主动去记住各种快捷键，力求少用鼠标，甚至去学习了 vim 和 emacs。但是，很多时候，鼠标是无可替代的，尤其是在图形界面大行其道时候。\n\n—— 以上是来自 [SimClick 模拟点击](https://github.com/rywiki/simclick) 作者的一段话，这是一款以网格细分方式模拟鼠标的作品，可以与本项目互补\n\n—— 由 [秦金伟](http://rsytes.coding-pages.com/) 推荐\n\n## 功能\n\n- 本模块使用按键区：CapsLockX + QWER ASDF\n- 非常舒适地使用 WASD QE RF 来模拟【完整的】鼠标功能，相信我，试过这种手感之后，你会喜欢上它的。\n- 指针移动时会自动黏附各种按钮、超链接。滚轮的指数级增长的加速度滚动机制使你再也不惧怕超级长的文章和网页。\n- 效果如图：\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\n\n## 使用方法如下\n\n| 作用于 | 按键                                  | 说明                                     |\n| ------ | ------------------------------------- | ---------------------------------------- |\n| 全局   | `CapsLockX + w a s d`                 | 鼠标移动（上下左右）                     |\n| 全局   | `CapsLockX + ad`                      | 将 HJKL 键切换到滚轮模式（上下左右滚动） |\n| 全局   | `CapsLockX + r f`                     | 垂直滚轮（上下）                         |\n| 全局   | `CapsLockX + Shift + r f`             | 水平滚轮（左右）                         |\n| 全局   | `CapsLockX + Ctrl + Alt + r f`        | 垂直滚轮自动滚动（上 下）                |\n| 全局   | `CapsLockX + Ctrl + Alt + Shift+ r f` | 水平滚轮自动滚动（左 右）                |\n| 全局   | `CapsLockX + rf`                      | rf 同时按相当于鼠标中键                  |\n| 全局   | `CapsLockX + e`                       | 鼠标左键                                 |\n| 全局   | `CapsLockX + q`                       | 鼠标右键                                 |\n\n## 操作细节\n\n快速连按 AD 步进=# Simulated Mouse Plugin (WASD QERF)\n\n> I have always considered myself a keyboard enthusiast, likely becoming a heavy keyboard user after injuring my finger joints while modeling in the past. I proactively learned various keyboard acceleration tools, memorized numerous shortcuts, and strived to minimize mouse usage, even learning vim and emacs. However, many times, the mouse is irreplaceable, especially with the prevalence of graphical interfaces.\n\n— Above is a statement from the author of [SimClick Simulated Click](https://github.com/rywiki/simclick), a project that simulates the mouse using a grid subdivision method, which can complement this project.\n\n— Recommended by [Qin Jinwei](http://rsytes.coding-pages.com/)\n\n## Features\n\n- This module uses the key area: CapsLockX + QWER ASDF\n- Comfortably uses WASD QE RF to simulate [complete] mouse functionality. Trust me, once you've tried this feel, you'll like it.\n- The pointer automatically adheres to various buttons, hyperlinks when moving. The exponential growth of scroll wheel acceleration ensures you'll never fear super long articles and web pages again.\n- See the effect:\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\n\n## Usage Instructions\n\n| Application    | Keys                                 | Description                            |\n| -------------- | ------------------------------------ | -------------------------------------- |\n| Global         | `CapsLockX + w a s d`                | Mouse movement (up, down, left, right) |\n| Global         | `CapsLockX + ad`                     | Switches HJKL keys to scroll mode (up, down, left, right scrolling) |\n| Global         | `CapsLockX + r f`                    | Vertical scroll wheel (up, down)       |\n| Global         | `CapsLockX + Shift + r f`            | Horizontal scroll wheel (left, right)  |\n| Global         | `CapsLockX + Ctrl + Alt + r f`       | Vertical scroll wheel auto-scrolling (up, down) |\n| Global         | `CapsLockX + Ctrl + Alt + Shift+ r f`| Horizontal scroll wheel auto-scrolling (left, right) |\n| Global         | `CapsLockX + rf`                     | Pressing rf together acts as the middle mouse button |\n| Global         | `CapsLockX + e`                      | Left mouse button                      |\n| Global         | `CapsLockX + q`                      | Right mouse button                     |\n\n## Operational Details\n\nQuickly tap AD for incremental steps.
# 快捷输入\n\n| 模式 | 快捷输入 | 说明                                            |\n| ---- | -------- | ----------------------------------------------- |\n| 全局 | `#D#`    | 日期输入：`(20220217)`                          |\n| 全局 | `#T#`    | 时间输入：`(20220217.220717)`                   |\n| 全局 | `#DT#`   | 日期时间输入：`2022-02-17 22:07:33`             |\n| 全局 | `#NPW#`  | 随机输入数字密码如： `7500331260229289`         |\n| 全局 | `#PW#`   | 随机输入数字字母密码如： `yyCTCNYodECTLr2h`     |\n| 全局 | `#WPW#`  | 随机输入数字字母密码如： `FtD5BB1m5H98eY7Y`     |\n| 全局 | `#SPW#`  | 随机输入数字字母符号密码如： `/})y+xK]z~>XKQ+p` |=| Mode   | Quick Input | Description                                |\n| ------ | ----------- | ------------------------------------------ |\n| Global | `#D#`       | Date input: `(20220217)`                   |\n| Global | `#T#`       | Time input: `(20220217.220717)`            |\n| Global | `#DT#`      | Date and time input: `2022-02-17 22:07:33` |\n| Global | `#NPW#`     | Random numeric password input: `7500331260229289`         |\n| Global | `#PW#`      | Random alphanumeric password input: `yyCTCNYodECTLr2h`     |\n| Global | `#WPW#`     | Random alphanumeric password input: `FtD5BB1m5H98eY7Y`     |\n| Global | `#SPW#`     | Random alphanumeric symbol password input: `/})y+xK]z~>XKQ+p` |
右手 \\][ 模拟Windows键和 Alt + Tab， 具体用法参见LaptopKeyboardFix 模块说明，默认启用=Press the right-hand key to simulate Windows key and Alt + Tab. For specific usage, refer to the LaptopKeyboardFix module instructions. Enabled by default.
首次启动？若想重新进入首次使用教学，请改为 1 并保存，然后使用 Ctrl+Alt+\\ 重载 CapsLockX。=First time starting? To re-enter the first-use tutorial, change it to 1 and save, then reload CapsLockX using Ctrl+Alt+\\ .
# 番茄时钟\n\n25 分钟固定循环休息提醒。\n\n使用 `CapsLockX + ,` 打开配置，然后修改 EnableScheduleTasks\e1 即可启用本插件。\n\n- 使用番茄报时（00 分和 30 分播放工作铃声，每小时的 25 分和 55 分播放休息铃声）（需要先开启定时任务）\n\n  ```ini\n  UseTomatoLife\e1\n  ```\n\n- 使用番茄报时时，自动切换桌面（使用番茄报时时，自动切换桌面（休息桌面为 1，工作桌面为 2）\n\n  ```ini\n  UseTomatoLifeSwitchVirtualDesktop\e1\n  ```\n\n注：如果只需要声音而不需要自动切换桌面的话，也可试试这款 Chrome 插件 [Tomato Life - Chrome 网上应用店](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\n\n注注: 本插件已经分离出一个独立项目，如果你喜欢番茄工作法的话可以参见雪星的 tomato-life 项目： [snomiao/tomato-life](https://github.com/snomiao/tomato-life)=# Pomodoro Timer\n\n25-minute fixed cycle rest reminder.\n\nUse `CapsLockX + ,` to open the configuration, then set EnableScheduleTasks\e1 to enable this plugin.\n\n- Use Pomodoro timing (plays work sound at 00 and 30 minutes, rest sound at 25 and 55 minutes of each hour) (scheduled tasks must be enabled first)\n\n  ```ini\n  UseTomatoLife\e1\n  ```\n\n- Automatically switch desktops when using Pomodoro timing (rest desktop as 1, work desktop as 2)\n\n  ```ini\n  UseTomatoLifeSwitchVirtualDesktop\e1\n  ```\n\nNote: If you only need the sound without automatic desktop switching, you can try this Chrome extension [Tomato Life - Chrome Web Store](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\n\nNote: This plugin has been separated into an independent project; if you like the Pomodoro Technique, you can check out Snowstar's tomato-life project: [snomiao/tomato-life](https://github.com/snomiao/tomato-life)
# 窗口增强插件 (CLX + 1234567890 ZXCV)\n\n## 功能简述\n\n用好 Win 10 自带的 10 个虚拟桌面豪华配置、多显示器自动排列窗口、半透明置顶、（注：任务栏和 AltTab 相关功能暂不兼容 Win11，窗口排列功能正常。）\n\n1. 窗口切换：`CapsLockX + [Shift] + Z`\n2. 窗口关闭：`CapsLockX + [Shift] + X`\n3. 窗口排列：`CapsLockX + [Shift] + C`\n4. 窗口置顶：`CapsLockX + [Shift] + V`\n5. 左手窗口管理：在 `Alt + Tab` 的界面，用 `WASD` 切换窗口，`X` 关掉窗口。\n6. 高效使用虚拟桌面：`CapsLockX + 0123456789` 切换、增减虚拟桌面，加上 `Shift` 键可以转移当前窗口\n7. 虚拟机与远程桌面快速脱离：双击左边 `Shift + Ctrl + Alt`。\n\n## 效果图\n\n- Alt + Tab 管理窗口增强\n  ![02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif](./02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif)\n- CapsLockX + C 一键排列窗口（这 GIF 是旧版本录的看起来比较卡，新版本优化过 API 就不卡了）\n  ![02-插件-窗口增强_一键排列窗口.gif](./docs/media/02-插件-窗口增强_一键排列窗口.gif)\n\n## 使用方法如下 ( Alt+Tab 与 CapsLockX )\n\n| 作用域       | 窗口增强模块                          | 说明                                       |\n| ------------ | ------------------------------------- | ------------------------------------------ |\n| Alt+Tab 界面 | `Q E`                                 | 左右切换多桌面                             |\n| Alt+Tab 界面 | `W A S D`                             | 上下左右切换窗口选择                       |\n| Alt+Tab 界面 | `X C`                                 | 关闭选择的窗口（目前 X 和 C 没有区别）     |\n| Win+Tab 视图 | `Alt + W A S D`                       | 切换窗口选择                               |\n| 全局         | `Win + [Shift] + B`                   | 定位到托盘任务(windows 系統自帯熱鍵)       |\n| 全局         | `Win + [Shift] + T`                   | 定位到任務栏任务(windows 系統自帯熱鍵)     |\n| 全局         | `Win + Shift + hjkl`                  | 在窗口之间按方向切换焦点                   |\n| 任务栏       | `Ctrl + W 或 Delete`                  | 在托盘图标或任务栏任务上，选择退出按钮     |\n| 全局         | `CapsLockX + 1 2 ... 9 0`             | 切换到第 1 .. 12 个桌面                    |\n| 全局         | `CapsLockX + Shift + 1 2 ... 9 0 - \e` | 把当前窗口移到第 n 个桌面(如果有的话)      |\n| 全局         | `CapsLockX + Alt + Backspace`         | 删除当前桌面（会把所有窗口移到上一个桌面） |\n| 全局         | `CapsLockX + C`                       | 快速排列当前桌面的窗口                     |\n| 全局         | `CapsLockX + Ctrl + C`                | 快速排列当前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Shift + C`               | 快速堆叠当前桌面的窗口                     |\n| 全局         | `CapsLockX + Shift + Ctrl + C`        | 快速堆叠当前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Z`                       | 循环切到最近使用的窗口                     |\n| 全局         | `CapsLockX + Shift + Z`               | 循环切到最不近使用的窗口                   |\n| 全局         | `CapsLockX + X`                       | 关掉当前标签页 Ctrl+W                      |\n| 全局         | `CapsLockX + Shift + X`               | 关掉当前窗口 Alt+F4                        |\n| 全局         | `CapsLockX + V`                       | 让窗口透明                                 |\n| 全局         | `CapsLockX + Shift + V`               | 让窗口保持透明（并置顶）                   |\n| 任意窗口     | `双击左边 Shift+Ctrl+Alt`             | 后置当前窗口， \\* 见下方注                 |\n\n\\*注： 双击左边 Shift+Ctrl+Alt 设计用于远程桌面与虚拟机，使其可与本机桌面窗口同时显示。\n例如 mstsc.exe、TeamViewer、VirtualBox、HyperV、VMWare 等远程桌面或虚拟机程序，配合 CapsLockX + Shift + V 透明置顶功能，让你在 Windows 的界面上同时使用 Linux 界面或 MacOS 界面再也不是难题。\n\n此处借用 [@yangbin9317 的评论](https://v2ex.com/t/772052#r_10458792)\n\n> 以 CapsLock 为抓手,打通底层逻辑,拉齐 Windows 和 Linux WM,解决了 Windows 难用的痛点\n\n(20220313) 对于两端都是 Windows 的情况，也可以考虑使用 [RemoteApp Tool - Kim Knight](http://www.kimknight.net/remoteapptool) 来代替远程桌面。=# Window Enhancement Plugin (CLX + 1234567890 ZXCV)\n\n## Brief Description of Features\n\nUtilize the deluxe configuration of 10 virtual desktops built into Win 10, automatic window arrangement for multiple monitors, semi-transparent always-on-top. (Note: Taskbar and AltTab related features are temporarily incompatible with Win11, window arrangement features work fine.)\n\n1. Window Switching: `CapsLockX + [Shift] + Z`\n2. Window Closing: `CapsLockX + [Shift] + X`\n3. Window Arrangement: `CapsLockX + [Shift] + C`\n4. Window Top: `CapsLockX + [Shift] + V`\n5. Left-Handed Window Management: In the `Alt + Tab` interface, switch windows with `WASD`, close windows with `X`.\n6. Efficient Use of Virtual Desktops: Switch, add or reduce virtual desktops with `CapsLockX + 0123456789`. Use Shift to move the current window.\n7. Quick Detaching from Virtual Machine and Remote Desktop: Double-click the left `Shift + Ctrl + Alt`.\n\n## Screenshots\n\n- Enhanced Alt + Tab Window Management\n  ![02-Plugin-WindowEnhancement_Alt+Tab+WASDManageWindows.gif](./02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif)\n- CapsLockX + C One-Click Window Arrangement (GIF recorded in older version, looks laggy but new version is optimized and smooth)\n  ![02-Plugin-WindowEnhancement_OneClickArrangeWindows.gif](./docs/media/02-插件-窗口增强_一键排列窗口.gif)\n\n## Usage (Alt+Tab and CapsLockX)\n\n| Scope        | Window Enhancement Module                      | Description                                     |\n| ------------ | ----------------------------------------------- | ----------------------------------------------- |\n| Alt+Tab Interface | `Q E`                                      | Switch between desktops left and right          |\n| Alt+Tab Interface | `W A S D`                                  | Switch window selection up, down, left, right   |\n| Alt+Tab Interface | `X C`                                      | Close selected window (currently no difference between X and C) |\n| Win+Tab View  | `Alt + W A S D`                                | Switch window selection                         |\n| Global        | `Win + [Shift] + B`                            | Locate to tray tasks (Windows default hotkey)   |\n| Global        | `Win + [Shift] + T`                            | Locate to taskbar tasks (Windows default hotkey)|\n| Global        | `Win + Shift + hjkl`                           | Switch focus between windows in direction       |\n| Taskbar       | `Ctrl + W or Delete`                           | Select exit button on tray icon or taskbar task |\n| Global        | `CapsLockX + 1 2 ... 9 0`                      | Switch to desktop 1 .. 12                       |\n| Global        | `CapsLockX + Shift + 1 2 ... 9 0 - \e`          | Move current window to desktop n (if exists)    |\n| Global        | `CapsLockX + Alt + Backspace`                  | Delete current desktop (moves all windows to the previous desktop) |\n| Global        | `CapsLockX + C`                                | Quickly arrange current desktop's windows       |\n| Global        | `CapsLockX + Ctrl + C`                         | Quickly arrange current desktop's windows (including minimized windows) |\n| Global        | `CapsLockX + Shift + C`                        | Quickly stack current desktop's windows         |\n| Global        | `CapsLockX + Shift + Ctrl + C`                 | Quickly stack current desktop's windows (including minimized windows) |\n| Global        | `CapsLockX + Z`                                | Cycle to the most recently used window          |\n| Global        | `CapsLockX + Shift + Z`                        | Cycle to the least recently used window         |\n| Global        | `CapsLockX +
# 锁屏自动息屏\n\n按 Win + L 锁屏时，立即关闭屏幕，适用于准备睡觉的时候自动把电脑屏幕关掉，不让它在睡觉的时候刺眼……\n按 Win + Alt + L 立即关闭屏幕，适用于准备睡觉的时候把电脑屏幕关掉，不让它在睡觉的时候刺眼……=# Auto Sleep Screen\n\nPress Win + L to lock the screen and immediately turn off the screen, useful for turning off the computer screen before going to sleep so it doesn't glare at night...\nPress Win + Alt + L to immediately turn off the screen, useful for turning off the computer screen before going to sleep so it doesn't glare at night...
你似乎还没有安装讯飞语音输入法，是否现在下载安装包并【手动安装】到默认目录？ - [讯飞输入法官网 - 更好用的手机输入法，提供专业输入法定制解决方案！]( https://srf.xunfei.cn/#/ )=It seems that you haven't installed the iFlytek Voice Input Method yet. Would you like to download and install the package to the default directory now? - [iFlytek Input Method Official Site - A better mobile input method, offering professional input method customization solutions!](https://srf.xunfei.cn/#/)
